from string import Template

##### RAG PROMPTS (ARABIC) #### 

#### System ####

system_prompt =Template("\n".join([
    "أنت مساعد ذكي مهمتك الإجابة عن استفسارات المستخدم.",
    "سوف يتم تزويدك بجمهرة من المستندات المتعلقة بسؤال المستخدم.",
    "عليك توليد الإجابة بناءً على المستندات المرفقة فقط.",
    "تجاهل المستندات التي لا صلة لها بسؤال المستخدم.",
    "يمكنك الاعتذار للمستخدم في حال عدم قدرتك على توليد الإجابة من خلال المستندات المتاحة.",
    "يجب عليك الإجابة بنفس اللغة التي استخدمها المستخدم في سؤاله.",
    "لتكن إجابتك مؤدبة ومحترمة.",
    "لتكن إجابتك دقيقة وموجزة وتجنب ذكر أي معلومات غير ضرورية.",
])
)

#### Document ####

document_prompt = Template(
    "\n".join([
        "## مستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)


#### Footer ####

footer_prompt = Template(
    "\n".join([
        "بناءً على المستندات المذكورة أعلاه فقط، يُرجى الإجابة عن سؤال المستخدم.",
        "## الإجابة:"
    ])
)